# 1+2+...n
n = int(input()) 
result = (n*(n+1))/2
print(result)
# .... Time complexity O(1)



j = int(input())
result1 = 0

for i in range(1,j+1):
    result1 += i
print(result1)
#.... Time complexity O(n)

'''
Note:
যে প্রোগ্রামের কমপ্লিক্সিটি O(1) , সেখানে n-এর মান 1 লক্ষ হলে সে প্রোগ্রামটি চলতে 1 মাইক্রোসেকেন্ড সময় লাগবে। 

আর যে প্রোগ্রামের কমপ্লিক্সিটি O(n), সেখানে n-এর মান 1 লাখ হলে প্রোগ্রামটি চলতে 1 লাখ মাইক্রোসেকেন্ড সময় লাগবে 

# ১ মাইক্রোসেকেন্ড O(1)
# ১ লাখ মাইক্রোসেকেন্ড O(n) /// n=100000
'''